[Killed] ArithmeticOperator
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:16:36
 // - Create a new method to check Odd/Even/Prime of a single supplied method
 
 export function isEven (valor: number): boolean {
-  let isEven = (valor > 2 && valor % 2 === 0) ? true : false
+  let isEven = (valor > 2 && valor * 2 === 0) ? true : false
   return isEven
 }

[Killed] ConditionalExpression
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:16:30
 // - Create a new method to check Odd/Even/Prime of a single supplied method
 
 export function isEven (valor: number): boolean {
-  let isEven = (valor > 2 && valor % 2 === 0) ? true : false
+  let isEven = (valor > 2 && false) ? true : false
   return isEven
 }

[Killed] ConditionalExpression
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:21:30
 }
 
 export function isOdd (valor: number): boolean {
-  let isOdd = (valor >= 1 && valor % 2 !== 0) ? true : false
+  let isOdd = (valor >= 1 && false) ? true : false
   return isOdd
 }

[Killed] ArithmeticOperator
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:21:36
 }
 
 export function isOdd (valor: number): boolean {
-  let isOdd = (valor >= 1 && valor % 2 !== 0) ? true : false
+  let isOdd = (valor >= 1 && valor * 2 !== 0) ? true : false
   return isOdd
 }

[Killed] ConditionalExpression
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:26:40
 }
 
 export function isPrime (valor: number): boolean {
-  for(let i = 2, s = Math.sqrt(valor); i <= s; i++)
+  for(let i = 2, s = Math.sqrt(valor); false; i++)
     if(valor % i === 0) return false
   return valor > 1

[Killed] EqualityOperator
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:26:42
 }
 
 export function isPrime (valor: number): boolean {
-  for(let i = 2, s = Math.sqrt(valor); i <= s; i++)
+  for(let i = 2, s = Math.sqrt(valor); i < s; i++)
     if(valor % i === 0) return false
   return valor > 1

[Killed] ArithmeticOperator
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:27:14
 
 export function isPrime (valor: number): boolean {
   for(let i = 2, s = Math.sqrt(valor); i <= s; i++)
-    if(valor % i === 0) return false
+    if(valor * i === 0) return false
   return valor > 1
 }

[Killed] ConditionalExpression
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:27:8
 
 export function isPrime (valor: number): boolean {
   for(let i = 2, s = Math.sqrt(valor); i <= s; i++)
-    if(valor % i === 0) return false
+    if(false) return false
   return valor > 1
 }

[Killed] ConditionalExpression
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:28:10
 export function isPrime (valor: number): boolean {
   for(let i = 2, s = Math.sqrt(valor); i <= s; i++)
     if(valor % i === 0) return false
-  return valor > 1
+  return false
 }
 

[Killed] EqualityOperator
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:28:16
 export function isPrime (valor: number): boolean {
   for(let i = 2, s = Math.sqrt(valor); i <= s; i++)
     if(valor % i === 0) return false
-  return valor > 1
+  return valor <= 1
 }
 

[Killed] ConditionalExpression
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:34:22
 export function getOddEvenKata (valor: number, valor2: number): (string | number)[] {
   let values: (string | number)[] = []; 
   
-  for(let i = valor; i <= valor2; i++)
+  for(let i = valor; false; i++)
     if(isEven(i))
       values.push('Even')

[Killed] EqualityOperator
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:34:24
 export function getOddEvenKata (valor: number, valor2: number): (string | number)[] {
   let values: (string | number)[] = []; 
   
-  for(let i = valor; i <= valor2; i++)
+  for(let i = valor; i < valor2; i++)
     if(isEven(i))
       values.push('Even')

[Killed] ConditionalExpression
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:35:8
   let values: (string | number)[] = []; 
   
   for(let i = valor; i <= valor2; i++)
-    if(isEven(i))
+    if(false)
       values.push('Even')
     else if(isPrime(i))

[Killed] ConditionalExpression
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:35:8
   let values: (string | number)[] = []; 
   
   for(let i = valor; i <= valor2; i++)
-    if(isEven(i))
+    if(true)
       values.push('Even')
     else if(isPrime(i))

[Killed] ConditionalExpression
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:37:13
   for(let i = valor; i <= valor2; i++)
     if(isEven(i))
       values.push('Even')
-    else if(isPrime(i))
+    else if(false)
       values.push(i)
     else if(isOdd(i))

[Killed] ConditionalExpression
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:37:13
   for(let i = valor; i <= valor2; i++)
     if(isEven(i))
       values.push('Even')
-    else if(isPrime(i))
+    else if(true)
       values.push(i)
     else if(isOdd(i))

[Killed] ConditionalExpression
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:39:13
       values.push('Even')
     else if(isPrime(i))
       values.push(i)
-    else if(isOdd(i))
+    else if(false)
       values.push('Odd')
     else

[Killed] ConditionalExpression
Unifesp-MestradoTesteSoftware/S7-Teste-Mutacao/src/odd-even-kata.ts:39:13
       values.push('Even')
     else if(isPrime(i))
       values.push(i)
-    else if(isOdd(i))
+    else if(true)
       values.push('Odd')
     else
